In [388]:
import numpy as np
import pandas as pd

In [389]:
from numpy.random import randn

In [390]:
np.random.seed(101)

In [391]:
pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [392]:
pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [393]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [394]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [395]:
df['W']

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [396]:
type(df['W'])

pandas.core.series.Series

In [397]:
type(df)

pandas.core.frame.DataFrame

In [398]:
df.W

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [399]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [400]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [401]:
df[['W','Z']]

          W         Z
A -0.993263  0.000366
B  1.025984  0.649826
C  2.154846 -0.346419
D  0.147027  1.024810
E -0.925874  0.610478

In [402]:
df[['X','Y']]

          X         Y
A  0.196800 -1.136645
B -0.156598 -0.031579
C -0.610259 -0.755325
D -0.479448  0.558769
E  1.862864 -1.133817

In [403]:
type(df[['X','Y']])

pandas.core.frame.DataFrame

In [404]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [405]:
df['new'] = df['W'] * df['X']

In [406]:
df

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366 -0.195474
B  1.025984 -0.156598 -0.031579  0.649826 -0.160667
C  2.154846 -0.610259 -0.755325 -0.346419 -1.315014
D  0.147027 -0.479448  0.558769  1.024810 -0.070492
E -0.925874  1.862864 -1.133817  0.610478 -1.724778

In [407]:
df['big'] = df['X'] + df['Y']

In [408]:
df

          W         X         Y         Z       new       big
A -0.993263  0.196800 -1.136645  0.000366 -0.195474 -0.939845
B  1.025984 -0.156598 -0.031579  0.649826 -0.160667 -0.188177
C  2.154846 -0.610259 -0.755325 -0.346419 -1.315014 -1.365584
D  0.147027 -0.479448  0.558769  1.024810 -0.070492  0.079321
E -0.925874  1.862864 -1.133817  0.610478 -1.724778  0.729047

In [409]:
df.drop('new',axis=1)

          W         X         Y         Z       big
A -0.993263  0.196800 -1.136645  0.000366 -0.939845
B  1.025984 -0.156598 -0.031579  0.649826 -0.188177
C  2.154846 -0.610259 -0.755325 -0.346419 -1.365584
D  0.147027 -0.479448  0.558769  1.024810  0.079321
E -0.925874  1.862864 -1.133817  0.610478  0.729047

In [410]:
df.drop('C')

          W         X         Y         Z       new       big
A -0.993263  0.196800 -1.136645  0.000366 -0.195474 -0.939845
B  1.025984 -0.156598 -0.031579  0.649826 -0.160667 -0.188177
D  0.147027 -0.479448  0.558769  1.024810 -0.070492  0.079321
E -0.925874  1.862864 -1.133817  0.610478 -1.724778  0.729047

In [411]:
df

          W         X         Y         Z       new       big
A -0.993263  0.196800 -1.136645  0.000366 -0.195474 -0.939845
B  1.025984 -0.156598 -0.031579  0.649826 -0.160667 -0.188177
C  2.154846 -0.610259 -0.755325 -0.346419 -1.315014 -1.365584
D  0.147027 -0.479448  0.558769  1.024810 -0.070492  0.079321
E -0.925874  1.862864 -1.133817  0.610478 -1.724778  0.729047

In [412]:
df.drop('new',axis=1,inplace=True)

In [413]:
df

          W         X         Y         Z       big
A -0.993263  0.196800 -1.136645  0.000366 -0.939845
B  1.025984 -0.156598 -0.031579  0.649826 -0.188177
C  2.154846 -0.610259 -0.755325 -0.346419 -1.365584
D  0.147027 -0.479448  0.558769  1.024810  0.079321
E -0.925874  1.862864 -1.133817  0.610478  0.729047

In [414]:
df.drop('E',axis=0,inplace=True)#axis = 0 by default

axis = 0 BY DEFAULT

In [415]:
df

          W         X         Y         Z       big
A -0.993263  0.196800 -1.136645  0.000366 -0.939845
B  1.025984 -0.156598 -0.031579  0.649826 -0.188177
C  2.154846 -0.610259 -0.755325 -0.346419 -1.365584
D  0.147027 -0.479448  0.558769  1.024810  0.079321

In [416]:
df.drop('big',axis=1,inplace=True)

In [417]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [418]:
df.shape

(4, 4)

In [419]:
df.loc['B']

W    1.025984
X   -0.156598
Y   -0.031579
Z    0.649826
Name: B, dtype: float64

In [420]:
df.loc[['B','C']]

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419

In [421]:
df.iloc[3]

W    0.147027
X   -0.479448
Y    0.558769
Z    1.024810
Name: D, dtype: float64

In [422]:
df.iloc[[1,3]]

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
D  0.147027 -0.479448  0.558769  1.024810

In [423]:
df.loc['A','W']

-0.993263499973366

In [424]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [425]:
df.loc[['B','A'],['X','Z']]

          X         Z
B -0.156598  0.649826
A  0.196800  0.000366

In [426]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [427]:
df.iloc[[0,1],[0,1]]

          W         X
A -0.993263  0.196800
B  1.025984 -0.156598

In [428]:
df['new'] = df['X'] * 2

In [429]:
df.drop(['Z','new'],axis=1,inplace=True)

In [430]:
df.drop('D',axis=0,inplace=True)

In [431]:
df

          W         X         Y
A -0.993263  0.196800 -1.136645
B  1.025984 -0.156598 -0.031579
C  2.154846 -0.610259 -0.755325

In [432]:
df.loc[['B','C'],['X','Y']]

          X         Y
B -0.156598 -0.031579
C -0.610259 -0.755325

In [433]:
df

          W         X         Y
A -0.993263  0.196800 -1.136645
B  1.025984 -0.156598 -0.031579
C  2.154846 -0.610259 -0.755325

In [434]:
df>0

       W      X      Y
A  False   True  False
B   True  False  False
C   True  False  False

In [435]:
booldf = df > 0

In [436]:
booldf

       W      X      Y
A  False   True  False
B   True  False  False
C   True  False  False

In [437]:
df[booldf]

          W       X   Y
A       NaN  0.1968 NaN
B  1.025984     NaN NaN
C  2.154846     NaN NaN

In [438]:
df[df>0]

          W       X   Y
A       NaN  0.1968 NaN
B  1.025984     NaN NaN
C  2.154846     NaN NaN

In [439]:
df

          W         X         Y
A -0.993263  0.196800 -1.136645
B  1.025984 -0.156598 -0.031579
C  2.154846 -0.610259 -0.755325

In [440]:
df['W'] > 0

A    False
B     True
C     True
Name: W, dtype: bool

In [441]:
df['W']

A   -0.993263
B    1.025984
C    2.154846
Name: W, dtype: float64

In [442]:
df[df['W']>0]

          W         X         Y
B  1.025984 -0.156598 -0.031579
C  2.154846 -0.610259 -0.755325

In [443]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [444]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [445]:
df[df['W']>0]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [446]:
df[df['Z']<0]

          W         X         Y         Z
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212

In [447]:
resultdf = df[df['W']>0]

In [448]:
resultdf

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [449]:
df[df['W']>0]['X']

A    2.084019
B    1.035125
E    1.192241
Name: X, dtype: float64

In [450]:
df[df>0]['X']

A    2.084019
B    1.035125
C         NaN
D    1.482495
E    1.192241
Name: X, dtype: float64

In [451]:
df[df['W']>0][['X','Y']]

          X         Y
A  2.084019 -0.376519
B  1.035125 -0.031160
E  1.192241 -1.046780

In [452]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [453]:
df[df['W']>0][['X','Y']][2:]

          X        Y
E  1.192241 -1.04678

In [454]:
df[df['W']>0].iloc[:,1:4]

          X         Y         Z
A  2.084019 -0.376519  0.230336
B  1.035125 -0.031160  1.939932
E  1.192241 -1.046780  1.292765

In [455]:
df[df['W']>0].iloc[0:-1,1:4]

          X         Y         Z
A  2.084019 -0.376519  0.230336
B  1.035125 -0.031160  1.939932

In [456]:
df[df['W']>0].loc['A':'D','X':'Z']

          X         Y         Z
A  2.084019 -0.376519  0.230336
B  1.035125 -0.031160  1.939932

In [457]:
df[df['X']>0].loc['A':'D',['X','Y']]

          X         Y
A  2.084019 -0.376519
B  1.035125 -0.031160
D  1.482495  0.961458

In [458]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [459]:
df.loc['B','Y'] = 0.012

In [460]:
df[(df['W']>0) and (df['Y']>0)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
df[(df['W']>0) & (df['Y']>0)]

          W         X      Y         Z
B  0.681209  1.035125  0.012  1.939932

In [ ]:
df[(df['W']>0) & (df['Y']>0)].loc[:,['X','Z']]

          X         Z
B  1.035125  1.939932

In [ ]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125  0.012000  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [ ]:
df[df['Y']>0]

          W         X         Y         Z
E -1.972605 -0.866885  0.720788 -1.223082

In [ ]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125  0.012000  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [ ]:
df[(df['W']>0) | (df['Y']>0)]

          W         X         Y         Z
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

## More Index Details

In [ ]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [ ]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [ ]:
# Reset to default 0,1...n index
df.reset_index() #df.reset_index(inplace=True)

  index         W         X         Y         Z
0     A -1.467514 -0.494095 -0.162535  0.485809
1     B  0.392489  0.221491 -0.855196  1.541990
2     C  0.666319 -0.538235 -0.568581  1.407338
3     D  0.641806 -0.905100 -0.391157  1.028293
4     E -1.972605 -0.866885  0.720788 -1.223082

In [462]:
newind = 'CA NY WY PR CP'.split()

In [463]:
newind

['CA', 'NY', 'WY', 'PR', 'CP']

In [467]:
df['states'] = newind

In [468]:
df

          W         X         Y         Z states
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125  0.012000  1.939932     NY
C -1.005187 -0.741790  0.187125 -0.732845     WY
D -1.382920  1.482495  0.961458 -2.141212     PR
E  0.992573  1.192241 -1.046780  1.292765     CP

In [477]:
df.set_index('states') #df.set_index('states',inplace=True)

               W         X         Y         Z
states
CA      0.386030  2.084019 -0.376519  0.230336
NY      0.681209  1.035125  0.012000  1.939932
WY     -1.005187 -0.741790  0.187125 -0.732845
PR     -1.382920  1.482495  0.961458 -2.141212
CP      0.992573  1.192241 -1.046780  1.292765

In [470]:
df

          W         X         Y         Z states
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125  0.012000  1.939932     NY
C -1.005187 -0.741790  0.187125 -0.732845     WY
D -1.382920  1.482495  0.961458 -2.141212     PR
E  0.992573  1.192241 -1.046780  1.292765     CP